# 1
# Напишіть цикл, який буде вимагати від користувача ввести слово, в якому є буква "о"
# (враховуються як великі так і маленькі).
# Цикл не повинен завершитися, якщо користувач ввів слово без букви "о".
print('Task 1')
input_word = input('Будь ласка, введіть слово з літерою "о": ')
# спосіб 1
while True:
    if input_word.lower().count('о'):
        print('Дякуємо!')
        break
    else:
        input_word = input('Введене слово не містить літери "о"! Будь ласка, введіть ще раз: ')

# спосіб 2
# while not input_word.lower().count('о'):
#     input_word = input('Введене слово не містить літери "о"! Будь ласка, введіть ще раз: ')
# print('Дякуємо!')


# 2
# Є list з даними lst1 = ['1', '2', 3, True, 'False', 5, '6', 7, 8, 'Python', 9, 0, 'Lorem Ipsum'].
# Напишіть код, який свормує новий list (наприклад lst2), який містить лише змінні типу стрінг, які присутні в lst1.
# Зауважте, що lst1 не є статичним і може формуватися динамічно від запуску до запуску.
print('\nTask 2')
lst1 = ['1', '2', 3, True, 'False', 5, '6', 7, 8, 'Python', 9, 0, 'Lorem Ipsum']
print('Список 1: %s' % lst1)
lst2 = []
for lst1_elem in lst1:
    if type(lst1_elem) == str:
        lst2.append(lst1_elem)
print('Список 2, який містить лише змінні типу "string" зі списку 1: {}'.format(lst2))


# 3
# Є стрінг з певним текстом (можна скористатися input або константою).
# Напишіть код, який визначить кількість слів в цьому тексті, які закінчуються на "о" (враховуються як великі так і маленькі).
print('\nTask 3')
user_input = input('Будь ласка, введіть текст: ')
words_list = user_input.split()
words_counter = 0
for user_word in words_list:
    if user_word.endswith('о') or user_word.endswith('О'):
        words_counter += 1
print(f'Кількість слів у введеному тексті, які закінчуються на "о": {words_counter}')
