# 1
# Сформуйте стрінг, в якому міститься інформація про певне слово.
# "Word [тут слово] has [тут довжина слова, отримайте з самого сдлва] letters", наприклад "Word 'Python' has 6 letters".
# Для отримання слова для аналізу скористайтеся константою або функцією input().
print('Task 1')
word_info_tpl = 'Word \'{}\' has {} letters'
word = input('Please, enter some word here: ')
word_info = word_info_tpl.format(word, len(word))
print(word_info)

# 2
# Напишіть программу "Касир в кінотеватрі", яка попросіть користувача ввести свсвій вік
# (можно використати константу або функцію input(), на екран має бути виведено лише одне повідомлення,
# також подумайте над варіантами, коли введені невірні дані).
# якщо користувачу менше 7 - вивести повідомлення"Де твої батьки?"
# якщо користувачу менше 16 - вивести повідомлення "Це фільм для дорослих!"
# якщо користувачу більше 65 - вивести повідомлення"Покажіть пенсійне посвідчення!"
# якщо вік користувача містить цифру 7 - вивести повідомлення "Вам сьогодні пощастить!"
# у будь-якому іншому випадку - вивести повідомлення "А білетів вже немає!"
print('Task 2')
user_age_str = input('Будь ласка, введіть ваш вік: ')
if user_age_str.isdigit():
    user_age_int = int(user_age_str)
    if user_age_int >= 0 and user_age_int < 7:
        print('Де твої батьки?')
    elif user_age_int >= 7 and user_age_int < 16:
        print('Це фільм для дорослих!')
    elif user_age_int >= 65 and user_age_int <= 125: # найстарша людина прожила 122,5 років
        print('Покажіть пенсійне посвідчення!')
    elif user_age_int >= 16 and user_age_int < 65:
        print('А білетів вже немає!')
    elif user_age_int > 125:
        print('Ви ввели невірні дані')
    if user_age_str.count('7') >= 1:
        print('Вам сьогодні пощастить!')
elif len(user_age_str) == 0:
    print('Ви нічого не ввели')
else:
    print('Ви ввели невірні дані')