# 1
# Задача: Створіть дві змінні first=10, second=30.
# Виведіть на екран результат математичної взаємодії (+, -, *, / и тд.) для цих чисел.
print('Task 1')
first = 10
second = 30
print('first + second =', first + second)
print('first - second =', first - second)
print('first * second =', first * second)
print('first / second =',  first / second)
print('first ** second =', first ** second)
print('first // second =', first // second)
print('first % second =', first % second)

# 2
# Задача: Створіть змінну и по черзі запишіть в неї результат порівняння (<, > , ==, !=) чисел з завдання 1.
# Виведіть на екран результат кожного порівняння.
print('\nTask 2')
comparing_result = first < second
print('Is first < second? -', comparing_result)
comparing_result = first > second
print('Is first > second? -', comparing_result)
comparing_result = first == second
print('Is first == second? -', comparing_result)
comparing_result = first != second
print('Is first != second? -', comparing_result)

# 3
# Задача: Створіть змінну - резкльтат конкатенації строк "Hello " та "world!".
str1 = 'Hello '
str2 = 'world!'
concatenation_result = str1 + str2